app/controllers/admin_controller.rb

SELECT * FROM `users` WHERE (`users`.`admin` = 0)
SELECT * FROM `episodes` WHERE (`episodes`.`id` = 4)
SELECT * FROM `users` WHERE (`users`.`id` = 492) LIMIT 1
---
    def index
      @users          = User.find_all_by_admin(0)
      @episodes       = Episode.find(:all)
      @user           = User.find_by_id(session[:user_id])

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 31)
---
    def show
      begin
        @task = Task.find(params[:id])

SELECT * FROM `episodes` WHERE (1 = 1) ORDER BY position DESC LIMIT 1
SELECT * FROM `users` WHERE (`users`.`admin` = 0)
---
    def stats
      @episodes       = Episode.find(:all)
      @users          = User.find_all_by_admin(0)

SELECT * FROM `episodes` WHERE (start_time > '2008-12-25 20:19:55')
---
    def new_task
      @task = Task.new()
      @task.materials.build
      @episodes = Episode.find(:all, :conditions => "start_time > '#{Time.now.to_s(:db)}'")

INSERT INTO `tasks` (`name`, `partial`, `desc`, `episode_id`, `position`, `created_at`) VALUES('Something', '', 'Desc', 5, 2, '2008-12-25 20:22:29')
---
    def save_task
      @task = Task.new(params[:task])
      if @task.save

SELECT * FROM `tasks` WHERE (`tasks`.`id` = '31') LIMIT 1
SELECT * FROM `materials` WHERE (`materials`.task_id = 32)
DELETE FROM `materials` WHERE `id` = 2
DELETE FROM `tasks` WHERE `id` = 31
---
      task = Task.find_by_id(params[:id])
      task.materials.each do |material|
        material.destroy
      end
      if task.destroy

SELECT * FROM `tasks` WHERE (`tasks`.`id` = '33') LIMIT 1
UPDATE `tasks` SET `desc` = 'up yours' WHERE `id` = 33
---
        task = Task.find_by_id(params[:id])
        task.update_attribute(:desc, params[:value])