app/controllers/episodes_controller.rb

  def edit
    @episode = Episode.find_by_id(params[:id])
---
SELECT * FROM `episodes` WHERE (`episodes`.`id` = '6') LIMIT 1

  def create
    @episode = Episode.new(params[:episode])
    if @episode.save
---
INSERT INTO `episodes` (`name`, `headstart_count`, `desc`, `headstart`, `position`, `start_time`) VALUES('Fourth', 17, 'Trying this shit', 18, 4, '2010-12-26 17:32:00')

  def update
    episode = Episode.find_by_id(params[:id])
    if episode.update_attributes(params[:episode])
---
SELECT * FROM `episodes` WHERE (`episodes`.`id` = '6') LIMIT 1
UPDATE `episodes` SET `start_time` = '2009-12-26 17:32:00', `desc` = 'Trying this shit out!' WHERE `id` = 6