app/controllers/material_controller.rb

SELECT * FROM `materials` WHERE (`materials`.`id` = 3)
DELETE FROM `materials` WHERE `id` = 3
---
  def destroy
    material = Material.find(params[:id])
    task_id = material.task_id
    material.destroy

INSERT INTO `materials` (`updated_at`, `data_updated_at`, `task_id`, `data_file_name`, `data_content_type`, `data_file_size`, `created_at`) VALUES('2008-12-25 20:54:29', '2008-12-25 20:54:29', 33, 'f.jpg', 'image/jpeg', 12131, '2008-12-25 20:54:29')
---
  def create
    @material = Material.new(params[:material])
    if @material.save