app/controllers/public_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 492) LIMIT 1
---
  def index
    unless session[:user_id].nil?
      @user = User.find_by_id(session[:user_id])