app/controllers/task_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 492) LIMIT 1
SELECT * FROM `episodes` WHERE (1 = 1 AND position = 2) LIMIT 1
SELECT * FROM `progresses` WHERE (`progresses`.user_id = 492) ORDER BY progresses.id DESC LIMIT 1
SELECT * FROM `tasks` WHERE (episode_id = 3) ORDER BY position DESC LIMIT 1
SELECT count(*) AS count_all FROM `progresses` WHERE (`progresses`.user_id = 492)
---
  def index
    @user = User.find_by_id(session[:user_id])
    @progress = @user.progresses
    if !@progress.empty? && @progress.last.task.is_last? && @progress.last.episode.is_last?

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 13)
---
  def show
    req_task = params[:id]
    @user = User.find_by_id(session[:user_id])
    begin
      @task = Task.find(req_task)

SELECT * FROM `answers` WHERE (`answers`.task_id = 13)
SELECT * FROM `tasks` WHERE (episode_id = 3) ORDER BY position DESC LIMIT 1
---
    task    = Task.find_by_id(params[:answer][:task_id])

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def update_first_name
    user = User.find_by_id(params[:id])