app/controllers/tasks_controller.rb

  def index
    @progress = current_user.progresses
    if !@progress.empty? && @progress.last.task.last? && @progress.last.episode.last?
---
SELECT * FROM `episodes` WHERE (`episodes`.`id` = 3)
SELECT count(*) AS count_all FROM `progresses` WHERE (`progresses`.user_id = 1)

  def show
    begin
      @task = Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 13)

  def new
    @task = Task.new
    @episodes = Episode.find(:all, :conditions => "start_time > '#{Time.now.to_s(:db)}'")
---
SELECT * FROM `episodes` WHERE (start_time > '2008-12-26 13:48:19')

  def edit
    @task = Task.find(params[:id])
    @episodes = Episode.find(:all, :conditions => "start_time > '#{Time.now.to_s(:db)}'")
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 13)
SELECT * FROM `episodes` WHERE (start_time > '2008-12-26 15:21:01')

  def create
    @task = Task.new(params[:task])
    if @task.save
---
INSERT INTO `tasks` (`name`, `partial`, `desc`, `episode_id`, `position`, `created_at`) VALUES('Trying it out', '', 'Just some testing', 5, 3, '2008-12-26 14:20:23')

  def update
    params[:task][:existing_material_attributes] ||= {}
    params[:task][:existing_answer_attributes] ||= {}

    @task = Task.find(params[:id])
    @task.update_attributes(params[:task])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 37)
UPDATE `tasks` SET `desc` = 'I wake up in a drunken daze. The rum had really hit me hard. I stood and saw the brightest light to the right of me and almost lost my hearing by the loudest noise I ever heard. × <br />\r\n\r\nSurely my place of slumber had not been chosen ideally. I walk toward a shimmering\r\nsea and turn left before I fall in.\r\nIn my condition I should not be close to the harsh seas, I instinctively headed toward South × to reach higher grounds.<br />\r\n\r\nOnce I climbed the hill I found a strange place, \'twas almost like a swamp with small isles here and there.<br /> \r\n\r\nThere was a clear path through it and i followed it, thinking surely there would be better place for me to sleep on the other side. <br />\r\n\r\nI swagger about and finally find a soft spot to lay down on. × <br />\r\n\r\nJust before falling asleep I see some old machinery and high walls around me.<br />\r\n\r\nI awake by the growl of my stomach, I\'m starting to sober up but I feel quite ill.\r\nI walk to the nearest port to find some good grub. A drunken oaf walk up to me,\r\ntell me what I did with his sister was unspeakable and hit me over the head with\r\na bottle. The last thing I see is a stairway into heaven from below. × <br />', `episode_id` = 5, `name` = 'Follow the footsteps - × marks the spot' WHERE `id` = 21

    task = Task.find_by_id(params[:id])

    if task.destroy
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = '37') LIMIT 1
DELETE FROM `tasks` WHERE `id` = 37

    task    = Task.find_by_id(params[:answer][:task_id])
---
SELECT * FROM `answers` WHERE (`answers`.task_id = 13)
SELECT * FROM `tasks` WHERE (episode_id = 3) ORDER BY position DESC LIMIT 1