app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :limit => 100)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def show
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def edit
    if !authorized? && params[:id] != current_user.id.to_s
      redirect_to edit_user_path(current_user)
    end
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`salt`, `crew`, `updated_at`, `crypted_password`, `row`, `remember_token_expires_at`, `admin`, `firstname`, `lastname`, `seat`, `episode`, `task`, `phone`, `team`, `remember_token`, `login`, `nationality`, `email`, `created_at`) VALUES('b7e8d00ff3e4c3c69dbfd3caf674a9e4faf20be7', 0, '2008-12-26 00:09:15', '3d5ca9d68f69295528278c7b30ba40e4cb262a68', '56', NULL, 0, NULL, NULL, 'D32', NULL, NULL, NULL, NULL, NULL, 'ique', NULL, 'ique@3h.se', '2008-12-26 00:09:15')

  def update
    @user = User.find(params[:id])
    #protect from form-forgery, only admins are allowed to change admin status
    if @user.admin != params[:user][:admin] && !authorized?
      params[:user][:admin] = @user.admin
    end
    @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `phone` = '', `lastname` = '', `nationality` = 'Sweden', `team` = 'Single Player', `firstname` = 'Fredrik', `updated_at` = '2008-12-26 01:50:50' WHERE `id` = 1

  def destroy
    user = User.find_by_id(params[:id])

    if user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
DELETE FROM `users` WHERE `id` = 2

	def search_users
	  query = "%" + params[:user][:query] + "%"
	  if params[:user][:query] == ""
	    users = User.find(:all)
---
SELECT * FROM `users` WHERE (login like '%iq%' OR firstname like '%iq%' OR lastname like '%iq%' OR team like '%iq%' OR nationality like '%iq%')