app/controllers/users_controller.rb

  def index
    @users = User.paginate(:page => params[:page], :order => "team")
---
SELECT * FROM `users` LIMIT 100